<a href="https://colab.research.google.com/github/NehalPisalkar/Nehal2025/blob/main/Untitled2_ipynb_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np

In [5]:
country = (["india","pakistan","nepal"])
pd.Series(country)

0       india
1    pakistan
2       nepal
dtype: object

In [6]:
marks_1 = {
    'maths':67,
    'english':57,
    'science':89,
    'hindi':100
}

marks_series = pd.Series(marks_1,name='nitish ke marks')
marks_series

maths       67
english     57
science     89
hindi      100
Name: nitish ke marks, dtype: int64

In [7]:
marks_2 = {
    'maths':67,
    'english':57,
    'science':np.nan,
    'hindi':100
}

marks_series_2 = pd.Series(marks_2,name='nitish ke marks')
marks_series_2

maths       67.0
english     57.0
science      NaN
hindi      100.0
Name: nitish ke marks, dtype: float64

In [8]:
marks_series

maths       67
english     57
science     89
hindi      100
Name: nitish ke marks, dtype: int64

In [9]:
marks_series.index

Index(['maths', 'english', 'science', 'hindi'], dtype='object')

In [10]:
marks_series.values

array([ 67,  57,  89, 100])

In [11]:
marks_series.dtype

dtype('int64')

In [12]:
marks_series.shape

(4,)

In [13]:
marks_series.size

4

In [14]:
marks_series.is_unique

check_unique = pd.Series([1,1,2,3,4,5])
check_unique.is_unique

False